In [14]:
import numpy as np
import pandas as pd
maas = {"Departman" :["Yazilim","Yazilim","Pazarlama","Pazarlama","IT","IT"],
        "Calisan":["Melih","Caglar","Burak","Hakan","Orkun","Mert"],
        "Maas":[10,12,18,25,35,50]
       }

In [15]:
maasDataFrame=pd.DataFrame(maas)
maasDataFrame

   Departman Calisan  Maas
0    Yazilim   Melih    10
1    Yazilim  Caglar    12
2  Pazarlama   Burak    18
3  Pazarlama   Hakan    25
4         IT   Orkun    35
5         IT    Mert    50

## GRUPLAMA

In [16]:
maasGrubu=maasDataFrame.groupby("Departman")

In [17]:
maasGrubu.count()

           Calisan  Maas
Departman
IT               2     2
Pazarlama        2     2
Yazilim          2     2

In [22]:
maasGrubu.mean(numeric_only=True)

           Maas
Departman
IT         42.5
Pazarlama  21.5
Yazilim    11.0

In [19]:
maasGrubu.min()

          Calisan  Maas
Departman
IT           Mert    35
Pazarlama   Burak    18
Yazilim    Caglar    10

In [20]:
maasGrubu.max()

          Calisan  Maas
Departman
IT          Orkun    50
Pazarlama   Hakan    25
Yazilim     Melih    12

In [21]:
maasGrubu.describe()

           Maas
          count  mean        std   min    25%   50%    75%   max
Departman
IT          2.0  42.5  10.606602  35.0  38.75  42.5  46.25  50.0
Pazarlama   2.0  21.5   4.949747  18.0  19.75  21.5  23.25  25.0
Yazilim     2.0  11.0   1.414214  10.0  10.50  11.0  11.50  12.0